Feature: Бронирование билетов в кинотеатре

  Background:
    Given пользователь находится на главной странице "https://qamid.tmweb.ru/client/index.php"

  Scenario: Успешное бронирование стандартного билета на завтра
    When пользователь выбирает завтрашний день
    And выбирает сеанс на "13:00"
    And выбирает свободное стандартное кресло
    And нажимает кнопку забронировать
    Then видит текст "Вы выбрали билеты:"

  Scenario: Успешное бронирование VIP билета на сегодня
    When пользователь выбирает сеанс с ID "225"
    And выбирает свободное VIP кресло
    And нажимает кнопку забронировать
    Then видит текст "Вы выбрали билеты:"

  Scenario: Попытка бронирования без выбора места
    When пользователь выбирает сеанс с ID "223"
    Then кнопка забронировать заблокирована